Revit 2027 API
Document.LoadFamily Method
Loads a family and all its types/symbols into the document.
Overload List
Name | Description
LoadFamily(Document) |  Loads the contents of this family document into another document.
LoadFamily(String) | Loads an entire family and all its types/symbols into the document.
LoadFamily(Document, IFamilyLoadOptions) |  Loads the contents of this family document into another document.
LoadFamily(String, Family) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
LoadFamily(String, IFamilyLoadOptions, Family) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace